Revit 2024 API
ParameterTypeId.ViewShowHiddenLines Property
 "Show Hidden Lines"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ViewShowHiddenLines { get; }
Visual Basic
Public Shared ReadOnly Property ViewShowHiddenLines As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ViewShowHiddenLines {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace